In [1]:
import pandas as pd

In [2]:
df = pd.read_html('http://sos.ga.gov/elections/election_results/2010_0720/0030601.htm')

In [3]:
df = df[1]

In [4]:
df.shape

(8, 28)

In [5]:
df.head(5)

,0,1,2,3,4,5,6,7,8,9,...,18,19,20,21,22,23,24,25,26,27
0,"U.S. Representative, District 6 Republican 100...",NaN,NaN,"Price 70,049","Totals 70,049",NaN,NaN,100.0%,100.0%,County,...,20419.0,20419.0,DEKALB,100%,6042.0,6042.0,FULTON,100%,24295.0,24295.0
1,NaN,NaN,"Price 70,049","Totals 70,049",NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,100.0%,100.0%,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,County,PPR,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,CHEROKEE,100%,19293,19293,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [6]:
df = df[4:]

In [7]:
df.head(5)

,0,1,2,3,4,5,6,7,8,9,...,18,19,20,21,22,23,24,25,26,27
4,CHEROKEE,100%,19293,19293,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,COBB,100%,20419,20419,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,DEKALB,100%,6042,6042,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7,FULTON,100%,24295,24295,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [8]:
df = df[df.columns[[0,2]]]

In [9]:
df.head(5)

          0      2
4  CHEROKEE  19293
5      COBB  20419
6    DEKALB   6042
7    FULTON  24295

In [10]:
df.columns = ['county', 'Tom Price']

In [11]:
df.tail(5)

     county Tom Price
4  CHEROKEE     19293
5      COBB     20419
6    DEKALB      6042
7    FULTON     24295

In [12]:
df = df.melt(id_vars=['county'])

In [13]:
df.columns = ['county', 'candidate', 'votes']

In [14]:
df.head()

     county  candidate  votes
0  CHEROKEE  Tom Price  19293
1      COBB  Tom Price  20419
2    DEKALB  Tom Price   6042
3    FULTON  Tom Price  24295

In [15]:
df['votes'] = df['votes'].astype(int)

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
county       4 non-null object
candidate    4 non-null object
votes        4 non-null int64
dtypes: int64(1), object(2)
memory usage: 176.0+ bytes

In [17]:
df['office'] = 'U.S. Representative'

In [18]:
df['district'] = '6'

In [19]:
df['party'] = 'Republican'

In [20]:
df.groupby(['candidate', 'party'])['votes'].sum()

candidate  party
Tom Price  Republican    70049
Name: votes, dtype: int64

In [21]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].head()

     county               office district       party  candidate  votes
0  CHEROKEE  U.S. Representative        6  Republican  Tom Price  19293
1      COBB  U.S. Representative        6  Republican  Tom Price  20419
2    DEKALB  U.S. Representative        6  Republican  Tom Price   6042
3    FULTON  U.S. Representative        6  Republican  Tom Price  24295

In [22]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].to_clipboard(index=False, sep=',')